app/views/feeds/index.html.erb

SELECT "users".* FROM "users"
---
<% @users.each do |user|%>
<% if (current_user.followees.include?(user) || user == current_user) && tweet.user_id == user.id %>