app/controllers/feeds_controller.rb

SELECT "feeds".* FROM "feeds"
SELECT "tweets".* FROM "tweets"
SELECT "users".* FROM "users"
---
  def index
    @feeds = Feed.all
    @tweets = Tweet.all
    @users = User.all

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_feed
      @feed = Feed.find(params[:id])