app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.new(tweet_params)
    @tweet.user_id = current_user.id
    @user = current_user

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["content", "Huh"], ["created_at", "2021-12-14 23:13:56.761299"], ["updated_at", "2021-12-14 23:13:56.761299"]]