app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "tweets".* FROM "tweets"
---
  def show
    @user = User.find(params[:id])
    @tweets = Tweet.all

INSERT INTO "users" ("first_name", "last_name", "username", "password_hash", "bio", "birthday", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    @user.password = user_params[:password_hash]
    @user.save

UPDATE "users" SET "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_hash", "password"], ["updated_at", "2021-12-14 20:18:24.904546"], ["id", 5]]
UPDATE "users" SET "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_hash", "$2a$12$ErXGHnj4Ju./FIGM0xVe5O9CeY/xKw4LXWTRLwTMnuJDe2Dg7xk3C"], ["updated_at", "2021-12-14 20:18:25.102197"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)
        @user.assign_attributes(user_params)
        @user.password = user_params[:password_hash]
        @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def unfollowing
    @user = User.find(params[:id])